src/mp_toir/Documents/мп_РегистрацияПроверокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_РегистрацияПроверокОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбъектаЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_РегистрацияПроверокОборудования/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ДоступностьОтбора = ОбщегоНазначенияВызовСервера.ДоступностьПараметраОтбораДокументов(ТекущийПользователь);
	
	Если Не ДоступностьОтбора = Неопределено Тогда
		Элементы.ПодразделениеОтбор.Доступность = ДоступностьОтбора.Подразделение;
		Элементы.ОтветственныйОтбор.Доступность = ДоступностьОтбора.Ответственный;
		Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Или РольДоступна("мп_БригадирТОиР") Тогда
			ЭтотОбъект.ПодразделениеОтбор = РеквизитыКонстант["ПодразделениеПользователя"];
			ЭтотОбъект.ОтветственныйОтбор = ТекущийПользователь;
		КонецЕсли;
		ЭтотОбъект.ОбъектЭксплуатацииОтбор = Справочники.ОбъектыЭксплуатации.ПустаяСсылка();
	КонецЕсли;
	
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	ЭтотОбъект.СтатусОбмена = ОбщегоНазначенияВызовСервера.ПерсональнаяНастройка(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбранныеПодразделения = ОбщегоНазначенияВызовСервера.ПодразделенияПользователей();
	
	Если ВыбранныеПодразделения.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВыбранныеПодразделения);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)
	
	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйОтборПриИзменении(Элемент)
	
	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииОтборПриИзменении(Элемент)
	
	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОбменаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = ОбщегоНазначенияКлиент.СтатусыОбменаКлиент(ЭтотОбъект.СтатусОбмена);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.СтатусОбмена.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.СтатусОбмена.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.СтатусОбмена.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.СтатусОбмена.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборОчистка(Элемент, СтандартнаяОбработка)

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.БригадирТОиР Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборСпискаНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.ПодразделениеОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.ОтветственныйОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатацииОтбор);

	СтатусыОбменаВЗапрос = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.СтатусОбмена Цикл
		СтатусыОбменаВЗапрос.Добавить(ТекСтатус.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыОбмена", СтатусыОбменаВЗапрос);

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

КонецПроцедуры

#КонецОбласти
